In [1]:
# Importing the csv module - provides functionality to read from and write to CSV files
# CSV (Comma Separated Values) is a common format for storing tabular data
import csv

In [ ]:
# 1. Just want to read and write into a CSV file. We don't need to import any library. We can just use Python's native import CSV and read and write into the file. 
# 2. But in case we want to do more than just read and write, that is, data manipulation, 
#        in that case we need to install or import the pandas library, which is a third party, and then we can do further actions on the CSV file.

In [3]:
# open(path, "w") - Opens a file in WRITE mode for writing CSV data
# csv.writer(file) - Creates a writer object to write rows to the CSV file
# writerow(list) - Writes a single row (list of values) to the CSV file
# f.close() - Closes the file to save and release the resource
f=open("/Users/admin/Movies/test/user.csv","w")

wrt=csv.writer(f)

wrt.writerow(["id","name","age"])
wrt.writerow([101,"Amit",23])
wrt.writerow([102,"Deepak",45])
wrt.writerow([103,"Sam",32])

f.close()

In [4]:
# open(path, "r") - Opens a file in READ mode
# csv.reader(file) - Creates a reader object that iterates over CSV rows
# list() - Converts the reader object to a list of lists
# Each inner list represents one row of the CSV file
f=open("/Users/admin/Movies/test/user.csv","r")


data=list(csv.reader(f))

data

[['id', 'name', 'age'],
 ['101', 'Amit', '23'],
 ['102', 'Deepak', '45'],
 ['103', 'Sam', '32']]

In [ ]:
# Importing pandas library as "pd" - a powerful data analysis and manipulation library
# Pandas provides DataFrame and Series data structures for handling structured data
# Commonly used for reading/writing CSV, Excel, and performing data operations
import pandas as pd # need to install using pip command

in panda - 1d data  - only one row and one column - data in one day is called a series. 
            2d data - multiple row, multiple column - data in 2D is called a data frame. 

more than 15 types of file can be read by panda 

since CSV file has multiple rows and columns; it comes under a data frame.

In [ ]:
# pd.read_csv(path) - Reads a CSV file and loads it into a Pandas DataFrame
# DataFrame is a 2D tabular data structure with rows and columns
# Since a CSA file is a multiple row column data, it comes under 2D and hence is a data frame. 
# Returns a DataFrame object stored in variable "df"
df=pd.read_csv("/Users/admin/Downloads/train.csv")

In [ ]:
# df.shape - Returns the dimensions of the DataFrame as (rows, columns)
# It is a property (not a method), so no parentheses needed
# Here: (891, 12) means 891 rows and 12 columns
df.shape        #Tell me how many rows and columns 
# if more info needed - try info

(891, 12)

In [ ]:
# df.info() - Displays a concise summary of the DataFrame
# Shows: column names, non-null counts, data types, and memory usage
# Useful for identifying missing values (non-null count < total rows)
# It gives descriptive information about data. 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
# df.head(n) - Returns the FIRST n rows of the DataFrame (default n=5)
# Useful for quickly previewing the data structure and content
df.head() #5 row default value if we dont enter any arg

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
# df["column_name"] - Selects a SINGLE column from the DataFrame
# Returns a Pandas Series (1D data structure) with all values from that column
df["Name"]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [15]:
# df[["col1","col2","col3"]] - Selects MULTIPLE columns from the DataFrame
# Pass a list of column names inside double brackets
# Returns a new DataFrame with only the specified columns
df[["Name","Sex","Age"]]

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
886                              Montvila, Rev. Juozas    male  27.0
887                       Graham, Miss. Margaret Edith  female  19.0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN
889                              Behr, Mr. Karl Howell    male  26.0
890                                Dooley, Mr. Patrick    male  32.0

[891 rows x 3 columns]

In [16]:
# df.loc[index] - Accesses a single ROW by its label/index
# Returns all column values for that row as a Pandas Series
# loc uses label-based indexing (not position-based)
df.loc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [17]:
# df.loc[start:end] - Selects a RANGE of rows by label/index
# Note: Unlike Python slicing, loc INCLUDES both start and end index
# Here: rows 0 through 5 (6 rows total) are returned
df.loc[0:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [ ]:
df[["Name","Sex","Age"]]    # gives multiple rows 

# Combining column selection with row slicing using loc

# df[[columns]].loc[start:end] - Select specific columns AND specific rows
# Returns Name, Sex, Age columns for rows 10 through 20

df[["Name","Sex","Age"]].loc[10:20]

                                                 Name     Sex   Age
10                    Sandstrom, Miss. Marguerite Rut  female   4.0
11                           Bonnell, Miss. Elizabeth  female  58.0
12                     Saundercock, Mr. William Henry    male  20.0
13                        Andersson, Mr. Anders Johan    male  39.0
14               Vestrom, Miss. Hulda Amanda Adolfina  female  14.0
15                   Hewlett, Mrs. (Mary D Kingcome)   female  55.0
16                               Rice, Master. Eugene    male   2.0
17                       Williams, Mr. Charles Eugene    male   NaN
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  31.0
19                            Masselmani, Mrs. Fatima  female   NaN
20                               Fynney, Mr. Joseph J    male  35.0

In [ ]:
# df["column"].loc[index] = value - Updates a specific cell value
# Sets the Name at index 0 to "Amit"
# Warning: SettingWithCopyWarning may appear; use df.loc[0,"Name"] instead
df["Name"].loc[0]="Amit"

<ipython-input-19-3927f8f004cc>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'].loc[0]="Amit"

In [ ]:
df.to_csv("/....give path ../ abc.csv",index=false)  to export data into a new csv file 

replave particular data in csv 
df['Name'].replace('<old value>','<new value>')

In [20]:
# Displaying the entire DataFrame to verify the updated value
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Amit,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# df["column"].replace(old_value, new_value) - Replaces values in a column
# Useful for fixing or updating data values across the DataFrame
df["Name"].replace("","")

In [21]:
# df.to_csv(path, index=False) - Exports the DataFrame to a CSV file
# index=False prevents writing the row index numbers to the CSV file
# Saves the modified DataFrame to a new CSV file
df.to_csv("/Users/admin/Movies/test/updatedata.csv",index=False)

In [ ]:
# pd.read_excel(path) - Reads an Excel file (.xlsx) into a DataFrame
# Requires openpyxl library installed for .xlsx file support
# Works similarly to read_csv() but for Excel format
df=pd.read_excel()

In [ ]:
# df.to_excel(path) - Exports the DataFrame to an Excel file (.xlsx)
# Similar to to_csv() but saves in Excel format
# Can specify sheet_name, index, and other parameters
df.to_excel() save in excel

In [ ]:
In Excel there is a three-layer workbook sheet, then cell.

In [22]:
# Importing openpyxl - a library for reading/writing Excel 2010+ (.xlsx) files
# Allows cell-level operations, formulas, sheet manipulation, and more
# Works directly with Excel format without needing Excel installed
import openpyxl

In [ ]:
way 1
# openpyxl.Workbook() - Creates a NEW Excel workbook in memory
# wb.active - Gets the currently active worksheet (default: "Sheet")
# sheet["A1"] = value - Sets a cell value using cell reference notation (e.g., A1, B2)
# sheet.cell(row, column, value) - Sets a cell value using row/column numbers
# wb.save(path) - Saves the workbook to a file on disk
wb=openpyxl.Workbook()       #to create new work book , if use this on existing then wil override the data in it 
sheet=wb.active

sheet["A1"]="Amit"

sheet.cell(row=1,column=2,value="Deepak")


wb.save("/Users/admin/Movies/test/data.xlsx")

In [ ]:
way 2
# Creating a workbook and writing multiple rows of data using a loop
# openpyxl.Workbook() - Creates a new workbook
# wb.active - Gets the active worksheet
# sheet.cell(row, column, value) - Writes data to specific cells
# Iterating through a list of tuples to populate rows dynamically
# wb.save(path) - Saves the workbook to disk
wb=openpyxl.Workbook()
sheet=wb.active

data=[(101,"Amit",23),(102,"Deepak",56),
     (103,"Ram",90)]


r=c=1

for id,name,age  in data:
    sheet.cell(row=r,column=c,value=id)
    sheet.cell(row=r,column=c+1,value=name)
    sheet.cell(row=r,column=c+2,value=age)
    r=r+1

wb.save("/Users/admin/Movies/test/data.xlsx")

In [35]:
# openpyxl.load_workbook(path) - Opens an EXISTING Excel workbook for reading
# wb.active - Gets the active worksheet
# sheet["A1"].value - Reads the value of a specific cell
# sheet.cell(row, column).value - Reads cell value using row/column numbers
# sheet["B"] - Selects an entire column (all cells in column B)
# sheet["A:C"] - Selects a range of columns (A through C)
# sheet[1] - Selects a single row (row 1)
# sheet[1:3] - Selects a range of rows (rows 1 through 3)
wb=openpyxl.load_workbook("/Users/admin/Movies/test/data.xlsx")
sheet=wb.active

#print(sheet["A1"].value)
#print(sheet.cell(row=1,column=2).value)
#for x in sheet["B"]:
#    print(x.value)

#sheet["A:C"]
#sheet[1]
sheet[1:3]

((<Cell 'Sheet'.A1>, <Cell 'Sheet'.B1>, <Cell 'Sheet'.C1>),
 (<Cell 'Sheet'.A2>, <Cell 'Sheet'.B2>, <Cell 'Sheet'.C2>),
 (<Cell 'Sheet'.A3>, <Cell 'Sheet'.B3>, <Cell 'Sheet'.C3>))

In [ ]:
# Loading an existing workbook and UPDATING a cell value
# openpyxl.load_workbook(path) - Opens the workbook for editing
# sheet["A1"] = new_value - Overwrites the existing cell value
# wb.save(path) - Saves the changes back to the file
wb=openpyxl.load_workbook("/Users/admin/Movies/test/data.xlsx")
sheet=wb.active

sheet["A1"]=123

wb.save("/Users/admin/Movies/test/data.xlsx")

Previously, we have seen we had to close the file for saving, but here we are not using the open function,
 so we don't need to close it separately. If we need to save the file in order to save the data,
 we don't need to close it, because we are not using the open function; we are using load.

In [ ]:
# Sheet management operations in openpyxl:
# wb.sheetnames - Returns a list of all sheet names in the workbook
# wb.create_sheet("name") - Creates a new worksheet with the given name
# wb["sheet_name"] - Accesses a specific sheet by name
# sheet.title - Gets or sets the title/name of the sheet
# sheet.title = "new_name" - Renames the sheet
# wb.remove(sheet) - Removes/deletes a sheet from the workbook
wb=openpyxl.load_workbook("/Users/admin/Movies/test/data.xlsx")

#print(wb.sheetnames) 
#wb.create_sheet("sales")
#sheet=wb["sales"]
#print(sheet.title)
#sheet.title="order"
#sheet=wb["order"]
#sheet["A1"]="Hello"
#sheet=wb["order"]
#wb.remove(sheet)

wb.save("/Users/admin/Movies/test/data.xlsx")

In [46]:
# Writing Excel FORMULAS using openpyxl
# Formulas are written as strings starting with "="
# sheet["C4"] = "=SUM(C1:C3)" - Adds a SUM formula in cell C4
# The formula calculates the sum of cells C1, C2, and C3
# Formulas are evaluated when the file is opened in Excel
wb=openpyxl.load_workbook("/Users/admin/Movies/test/data.xlsx")

sheet=wb.active

sheet["C4"]="=SUM(C1:C3)"

wb.save("/Users/admin/Movies/test/data.xlsx")

In [ ]:
# Importing the json module - handles JSON (JavaScript Object Notation) data
# JSON is a lightweight data format used for data exchange between systems
# Provides methods: loads/load (parse), dumps/dump (serialize)
import json

follows dictionary data type 

# refer to working with json.txt file in the python notes folder

In [ ]:
# print(type(data)) #=> dict
# ---------------------------------
# json          python
# object        dict
# array         list
# string        str
# number(int)   int
# number(real)  float
# true          True
# false         False
# null          None

In the 
Reading is called loading. 
Writing is called dumping. 
Data loading and data dumping

In [50]:
# Defining a JSON-formatted string (multi-line using triple quotes)
# JSON structure: objects use {}, arrays use [], keys are strings in double quotes
# JSON values can be: strings, numbers, booleans (true/false), arrays, objects, null
people_string=''''''
{
 "people":[
       {
        "name": "John",
        "phone": "123-234-5678",
        "emails": ["Jhon@gmail.com","jhonsmith@gmail.com"],
        "has_license": false
        },
        
        {
        "name": "John Doe",
        "phone": "123-234-5678",
        "emails": ["Jhon23@gmail.com","jhonDoe@gmail.com"],
        "has_license": true
        }
      ]
   }''''

In [ ]:
# JSON module methods summary:
# json.load(file)  - Reads JSON from a FILE and converts to Python dict/list
# json.loads(string) - Reads JSON from a STRING and converts to Python dict/list
# json.dump(data, file) - Writes Python data to a FILE as JSON
# json.dumps(data) - Converts Python data to a JSON STRING
# "s" at the end stands for "string"
load : file
loads : string
    
dump : file
dumps: string

In [51]:
# json.loads(string) - Parses a JSON STRING into a Python dictionary
# Converts JSON objects to dict, arrays to list, true/false to True/False
# "loads" = load from string
data=json.loads(people_string)

In [52]:
# type() - Checking the data type after JSON parsing
# json.loads() converts JSON objects to Python dict type
type(data)

dict

In [53]:
# Displaying the parsed JSON data as a Python dictionary
# Notice: JSON false/true are converted to Python False/True
data

{'people': [{'name': 'John',
   'phone': '123-234-5678',
   'emails': ['Jhon@gmail.com', 'jhonsmith@gmail.com'],
   'has_license': False},
  {'name': 'John Doe',
   'phone': '123-234-5678',
   'emails': ['Jhon23@gmail.com', 'jhonDoe@gmail.com'],
   'has_license': True}]}

In [ ]:
# json.dump(data, file, indent) - Writes Python data to a FILE as JSON
# "dump" = dump to file (not string)
# indent=3 adds pretty formatting with 3-space indentation
# Using "with open" ensures the file is properly closed after writing
with open("/Users/admin/Movies/test/data.json","w") as f:
    json.dump(data,f) we get data in single line without beautifying 

    json.dump(data,f,indent=3). we get data with indentation

In [56]:
# json.load(file) - Reads JSON data from a FILE and converts to Python dict
# "load" = load from file (not string)
# Using "with open" ensures proper file handling
with open("/Users/admin/Movies/test/data.json","r") as f:
    data1=json.load(f)

In [57]:
# Displaying the data read from the JSON file
# Confirms the data was correctly saved and loaded back
data1

{'people': [{'name': 'John',
   'phone': '123-234-5678',
   'emails': ['Jhon@gmail.com', 'jhonsmith@gmail.com'],
   'has_license': False},
  {'name': 'John Doe',
   'phone': '123-234-5678',
   'emails': ['Jhon23@gmail.com', 'jhonDoe@gmail.com'],
   'has_license': True}]}

In [58]:
# json.dumps(data, indent) - Converts Python data to a JSON formatted STRING
# "dumps" = dump to string (not file)
# indent=4 adds pretty formatting with 4-space indentation
# Returns a string, not written to file
st=json.dumps(data1,indent=4)

In [60]:
# Printing the JSON formatted string to see the pretty-printed output
print(st)

{
    "people": [
        {
            "name": "John",
            "phone": "123-234-5678",
            "emails": [
                "Jhon@gmail.com",
                "jhonsmith@gmail.com"
            ],
            "has_license": false
        },
        {
            "name": "John Doe",
            "phone": "123-234-5678",
            "emails": [
                "Jhon23@gmail.com",
                "jhonDoe@gmail.com"
            ],
            "has_license": true
        }
    ]
}

In [ ]:
# Importing PyYAML library - handles YAML (YAML Ain't Markup Language) data
# YAML is a human-readable data serialization format (used in DevOps: Ansible, K8s, Docker)
# Similar to JSON but uses indentation instead of braces/brackets
import yaml

we get dict or list  kind of data from it

In [62]:
# yaml.safe_load(file) - Reads and parses a YAML file into Python objects
# safe_load is preferred over load() for security (prevents code execution)
# Converts YAML to Python dict/list structures
with open("/Users/admin/Downloads/ansible_configfile_AMIS.yml","r") as f:
    data=yaml.safe_load(f)

In [64]:
# Displaying the parsed YAML data (commented out)
#data

In [65]:
# Creating a Python list of dictionaries to be saved as YAML
# This represents server configuration data
data=[{"host":"192.168.0.1",
      "port":22,
      "user":"root",
      "password":"redhat"}]

In [ ]:
# yaml.safe_dump(data, file) - Writes Python data to a FILE in YAML format
# safe_dump converts Python dict/list to YAML formatted text
# YAML output uses indentation and "- " for list items
with open("/Users/admin/Movies/test/dev.yml","w") as f:
    data=yaml.safe_dump(data,f)

    # data to be written 
    # f-- file in which we are writing the data

In [67]:
# yaml.safe_load(file) - Reading back the YAML file into Python
# Verifying the data was correctly saved in YAML format
with open("/Users/admin/Movies/test/dev.yml","r") as f:
    data=yaml.safe_load(f)

In [68]:
# Displaying the data loaded from the YAML file
# YAML safe_load converts it back to a Python list of dictionaries
data

[{'host': '192.168.0.1', 'password': 'redhat', 'port': 22, 'user': 'root'}]

In [69]:
# Modifying YAML data - adding/updating a key-value pair in the dictionary
# data[0] accesses the first dictionary in the list
# Adding a new key "pasword" with value "redhat@123"
data[0]["pasword"]="redhat@123"

In [70]:
# Displaying updated data to verify the new key-value pair was added
data

[{'host': '192.168.0.1',
  'password': 'redhat',
  'port': 22,
  'user': 'root',
  'pasword': 'redhat@123'}]

In [71]:
# yaml.safe_dump(data, file) - Saving the modified data to a NEW YAML file
# Writing to prod.yml (production configuration) with updated password
with open("/Users/admin/Movies/test/prod.yml","w") as f:
    data=yaml.safe_dump(data,f)

In [ ]:
# CSV Module
# Method	Description
csv.writer(file)	Creates a writer object to write rows to CSV
csv.writerow(list)	Writes a single row to the CSV file
csv.reader(file)	Creates a reader object to iterate over CSV rows

In [ ]:

🐼 Pandas Module
Method	Description
pd.read_csv(path)	Reads a CSV file into a DataFrame
pd.read_excel(path)	Reads an Excel file into a DataFrame
df.shape	Returns dimensions as (rows, columns)
df.info()	Shows column names, types, non-null counts
df.head(n)	Returns the first n rows (default 5)
df["col"]	Selects a single column (returns Series)
df[["col1","col2"]]	Selects multiple columns (returns DataFrame)
df.loc[index]	Accesses rows by label/index
df.loc[start:end]	Selects a range of rows (inclusive)
df["col"].replace()	Replaces values in a column
df.to_csv(path)	Exports DataFrame to CSV
df.to_excel(path)	Exports DataFrame to Excel

In [ ]:

📊 Openpyxl Module
Method	Description
openpyxl.Workbook()	Creates a new Excel workbook
openpyxl.load_workbook(path)	Opens an existing workbook
wb.active	Gets the active worksheet
sheet["A1"] / sheet.cell()	Read/write cell values
sheet[1:3] / sheet["A:C"]	Select row/column ranges
wb.sheetnames	Lists all sheet names
wb.create_sheet() / wb.remove()	Sheet management
wb.save(path)	Saves workbook to file
Excel formulas (e.g., =SUM())	Write formulas as strings

In [ ]:
📋 JSON Module
Method	Description
json.loads(string)	Parses JSON string → Python dict
json.load(file)	Reads JSON file → Python dict
json.dumps(data)	Converts Python dict → JSON string
json.dump(data, file)	Writes Python dict → JSON file

In [ ]:
📝 YAML Module
Method	Description
yaml.safe_load(file)	Reads YAML file → Python dict/list
yaml.safe_dump(data, file)	Writes Python data → YAML file